elua/elua/src/platform/lm3s/usblib/host/usbhostenum.c
        g_sUSBHCD.pClassDrivers[g_sUSBHCD.lEventDriver]->pfnIntHandler(
           &g_sUSBHCD.EventInfo);
    }
}

//*****************************************************************************
//
// Internal memory allocation space is two unsigned long values where each
// bit represents a 64 byte block in the FIFO.  This requires 64 bits for
// the 4096 bytes of FIFO available.
//
//*****************************************************************************
static unsigned long g_ulAlloc[2];

//*****************************************************************************
//
// This function handles freeing FIFO memory that has been allocated using the
// FIFOAlloc() function.
//
//*****************************************************************************
static void
FIFOFree(tUSBHCDPipe *pUSBPipe)
{
    unsigned long ulMask;

    //
    // Calculate the mask value to use to clear off the allocated blocks used
    // by the USB pipe specified by pUSBPipe.
    //
    ulMask = (1 << (pUSBPipe->ucFIFOSize - 2)) - 1;
    ulMask = ulMask << pUSBPipe->ucFIFOBitOffset;

    //
    // Determine which 32 bit word to access based on the size.
    //
    if(pUSBPipe->ucFIFOSize > USB_FIFO_SZ_64)
    {
        //
        // If the FIFO size is greater than 64 then use the upper 32 bits.
        //
        g_ulAlloc[1] &= ~ulMask;
    }
    else
    {
        //
        // If the FIFO size is less than or equal to 64 then use the lower
        // 32 bits.
        //
        g_ulAlloc[0] &= ~ulMask;
    }
}

//*****************************************************************************
//
// This function is used to allocate FIFO memory to a given USB pipe.
//
// \param pUSBPipe is the USB pipe that needs FIFO memory allocated.
// \param ulSize is the minimum size in bytes of the FIFO to allocate.
//
// This function will allocate \e ulSize bytes to the USB pipe in the
// \e pUSBPipe parameter.  The function will fill the pUSBPipe structure
// members ucFIFOSize and ucFIFOAddr with values that can be used with the
// USBFIFOConfigSet() API.  This allocation uses a first fit algorithm.
//
// \return This function returns the size of the block allocated.
//
//*****************************************************************************
static unsigned long
FIFOAlloc(tUSBHCDPipe *pUSBPipe, unsigned long ulSize)
{
    unsigned long ulBlocks, ulStart, ulBlockSize;
    unsigned short usFIFOAddr;
    unsigned long ulTemp, ulIndex;

    //
    // Save which 32 bit value to access, the upper is for blocks greater
    // than 64 and the lower is for block 64 or less.
    //
    if(ulSize > 64)
    {
        ulIndex = 1;
    }
    else
    {
        ulIndex = 0;
    }

    //
    // Initial FIFO address is 0.
    //
    usFIFOAddr = 0;

    //
    // Initialize the bit pattern and bit location.
    //
    ulBlocks = 1;
    ulStart = 0;

    //
    // The initial block size is always the minimum size of 64 bytes.
    //
    ulBlockSize = 64;

    //
    // The initial size and offset are 64 and 0.
    //
    pUSBPipe->ucFIFOBitOffset = 0;
    pUSBPipe->ucFIFOSize = 3;

    //
    // Scan through 32 bits looking for a memory block large enough to fill
    // the request.
    //
    while(usFIFOAddr <= 32)
    {
        //
        // If the pattern is zero then it is a possible match.
        //
        if((g_ulAlloc[ulIndex] & ulBlocks) == 0)
        {
            //
            // If the size is large enough then save it and break out of the
            // loop.
            //
            if(ulBlockSize >= ulSize)
            {
                //
                // Mark the memory as allocated.
                //
                g_ulAlloc[ulIndex] |= ulBlocks;

                break;
            }

            //
            // Increment the size of the FIFO block.
            //
            pUSBPipe->ucFIFOSize++;

            //
            // Add in a new bit to the size of the allocation.
            //
            ulBlocks = ulBlocks | (ulBlocks << 1) ;

            //
            // Double the current size.
            //
            ulBlockSize <<= 1;

        }
        else
        {
            //
            // Need to start over looking because the last allocation match
            // failed, so reset the bit offset to the current location and the
            // size to 64 bytes.
            //
            pUSBPipe->ucFIFOBitOffset = usFIFOAddr;
            pUSBPipe->ucFIFOSize = 3;

            //
            // Reset the block size to the minimum (64 bytes).
            //
            ulBlockSize = 64;

            //
            // Store the current starting bit location and set the block mask
            // to this value.
            //
            ulStart = 1 << usFIFOAddr;
            ulBlocks = ulStart;
        }

        //
        // Increase the address of the FIFO offset.
        //
        usFIFOAddr++;
    }

    //
    // If there was no block large enough then fail this call.
    //
    if(usFIFOAddr > 32)
    {
        ulBlockSize = 0;
        pUSBPipe->usFIFOAddr = 0;
        pUSBPipe->ucFIFOBitOffset = 0;
        pUSBPipe->ucFIFOSize = 0;
    }
    else
    {
        //
        // Calculate the offset in the FIFO.
        //
        ulTemp = pUSBPipe->ucFIFOBitOffset * 64;

        //
        // Sizes greater than 64 are allocated in the second half of the FIFO
        // memory space.
        //
        if(ulSize > 64)
        {
            ulTemp += 2048;
        }

        //
        // Convert this to the value that can be set in the USB controller.
        //
        pUSBPipe->usFIFOAddr = (unsigned short)ulTemp;
    }
    return(ulBlockSize);
}

//*****************************************************************************
//
//! This function is used to allocate a USB HCD pipe.
//!
//! \param ulIndex specifies which USB controller to use.
//! \param ulEndpointType is the type of endpoint that this pipe will be
//! communicating with.
//! \param ulDevAddr is the device address to use for this endpoint.
//! \param ulSize is the size of the FIFO in bytes.
//! \param pfnCallback is the function that will be called when events occur on
//! this USB Pipe.
//!
//! Since there are a limited number of USB HCD pipes that can be used in the
//! host controller, this function is used to temporarily or permanently
//! acquire one of the endpoints.  Unlike the USBHCDPipeAlloc() function this
//! function allows the caller to specify the size of the FIFO allocated to
//! this endpoint in the \e ulSize parameter.  This function also provides a
//! method to register a callback for status changes on this endpoint.  If no
//! callbacks are desired then the \e pfnCallback function should be set to 0.
//! The callback should be used when using the USBHCDPipeSchedule() function
//! so that the caller is notified when the action is complete.
//!
//! \return This function returns a value indicating which pipe was reserved.
//! If the value is 0 then there were no pipes currently available.  This value
//! should be passed to any USBHCDPipe APIs to indicate which pipe is being
//! accessed.
//
//*****************************************************************************
unsigned long
USBHCDPipeAllocSize(unsigned long ulIndex, unsigned long ulEndpointType,
                    unsigned long ulDevAddr, unsigned long ulSize,
                    tHCDPipeCallback pfnCallback)
{
    long lIdx, lDMAIdx;

    ASSERT(ulIndex == 0);

    //
    // Find a USB pipe that is free.
    //
    for(lIdx = 0; lIdx < MAX_NUM_PIPES; lIdx++)
    {
        //
        // Handle OUT Pipes.
        //
        if(ulEndpointType & EP_PIPE_TYPE_OUT)
        {
            //
            // A zero address indicates free.
            //
            if(g_sUSBHCD.USBOUTPipes[lIdx].ulDevAddr == 0)
            {
                //
                // Set up uDMA for the pipe.
                //
                if(ulEndpointType & EP_PIPE_USE_UDMA)
                {
                    //
                    // First three endpoints have fixed channels on some
                    // parts so bias the pipes to match this as best is
                    // possible.
                    //
                    if(lIdx < 3)
                    {
                        //
                        // Check if the fixed channel is available for this
                        // USB pipe.
                        //
                        if((g_sUSBHCD.ucDMAChannels[1 + (lIdx * 2)] ==
                                      USBHCD_DMA_UNUSED))
                        {
                            //
                            // The default channel was available so use it.
                            //
                            g_sUSBHCD.ucDMAChannels[1 + (lIdx * 2)] = lIdx;
                            g_sUSBHCD.USBOUTPipes[lIdx].ucDMAChannel =
                                1 + (lIdx * 2);
                        }
                        else
                        {
                            //
                            // Go to the next USB pipe if the fixed one was not
                            // available.
                            //
                            continue;
                        }
                    }
                    else
                    {
                        //
                        // Either the fixed channel was not available or the
                        // pipe index was more than the first 3 pipes that are
                        // available on all parts.
                        //
                        for(lDMAIdx = 1; lDMAIdx < MAX_NUM_DMA_CHANNELS;
                            lDMAIdx += 2)
                        {
                            //
                            // Find any available channel.
                            //
                            if(g_sUSBHCD.ucDMAChannels[lDMAIdx] ==
                               USBHCD_DMA_UNUSED)
                            {
                                //
                                // Save the index and the DMA channel
                                // information.
                                //
                                g_sUSBHCD.ucDMAChannels[lDMAIdx] = lIdx;
                                g_sUSBHCD.USBOUTPipes[lIdx].ucDMAChannel =
                                    lDMAIdx;
                            }
                        }
                    }

                    //
                    // If no DMA channel was available then just disable DMA
                    // on this pipe.
                    //
                    if(g_sUSBHCD.USBOUTPipes[lIdx].ucDMAChannel ==
                       USBHCD_DMA_UNUSED)
                    {
                        ulEndpointType &= ~EP_PIPE_USE_UDMA;
                    }
                    else
                    {
                        //
                        // Set the DMA channel for this endpoint, this has no
                        // effect on parts without configurable DMA.
                        //
                        MAP_USBEndpointDMAChannel(
                            USB0_BASE, INDEX_TO_USB_EP(lIdx + 1),
                            g_sUSBHCD.USBOUTPipes[lIdx].ucDMAChannel);

                        //
                        // Clear all the attributes for the channel
                        //
                        MAP_uDMAChannelAttributeDisable(
                            g_sUSBHCD.USBOUTPipes[lIdx].ucDMAChannel,
                            UDMA_ATTR_ALL);

                        //
                        // Configure the uDMA channel for the pipe
                        //
                        MAP_uDMAChannelControlSet(
                            g_sUSBHCD.USBOUTPipes[lIdx].ucDMAChannel,
                            (UDMA_SIZE_8 | UDMA_SRC_INC_8 | UDMA_DST_INC_NONE |
                             UDMA_ARB_64));
                    }
                }

                //
                // Save the endpoint type and device address and callback
                // function.
                //
                g_sUSBHCD.USBOUTPipes[lIdx].ulType = ulEndpointType;
                g_sUSBHCD.USBOUTPipes[lIdx].ulDevAddr = ulDevAddr;
                g_sUSBHCD.USBOUTPipes[lIdx].pfnCallback = pfnCallback;

                //
                // Clear out any pending status on this endpoint in case it
                // was in use before a allowing a new device class to use it.
                //
                MAP_USBHostEndpointStatusClear(USB0_BASE,
                                               INDEX_TO_USB_EP(lIdx + 1),
                                               USB_HOST_OUT_STATUS);

                //
                // Initialize the endpoint as idle.
                //
                g_sUSBHCD.USBOUTPipes[lIdx].eState = PIPE_IDLE;

                //
                // Allocate space in the FIFO for this endpoint.
                //
                if(FIFOAlloc(&g_sUSBHCD.USBOUTPipes[lIdx], ulSize) != 0)
                {
                    //
                    // Configure the FIFO.
                    //
                    MAP_USBFIFOConfigSet(USB0_BASE, INDEX_TO_USB_EP(lIdx + 1),
                                         g_sUSBHCD.USBOUTPipes[lIdx].usFIFOAddr,
                                         g_sUSBHCD.USBOUTPipes[lIdx].ucFIFOSize,
                                         USB_EP_HOST_OUT);
                }

                //
                // Set the function address for this endpoint.
                //
                MAP_USBHostAddrSet(USB0_BASE, INDEX_TO_USB_EP(lIdx + 1),
                                   ulDevAddr, USB_EP_HOST_OUT);

                break;
            }
        }
        //
        // Handle IN Pipes.
        //
        else if(ulEndpointType & EP_PIPE_TYPE_IN)
        {
            //
            // A zero address indicates free.
            //
            if(g_sUSBHCD.USBINPipes[lIdx].ulDevAddr == 0)
            {
                //
                // Set up uDMA for the pipe.
                //
                if(ulEndpointType & EP_PIPE_USE_UDMA)
                {
                    //
                    // First three endpoints have fixed channels on some
                    // parts so bias the pipes to match this as best is
                    // possible.
                    //
                    if(lIdx < 3)
                    {
                        //
                        // Check if the fixed channel is available for this
                        // USB pipe.
                        //
                        if(g_sUSBHCD.ucDMAChannels[lIdx * 2] ==
                           USBHCD_DMA_UNUSED)
                        {
                            //
                            // The default channel was available so use it.
                            //
                            g_sUSBHCD.ucDMAChannels[lIdx * 2] = lIdx;
                            g_sUSBHCD.USBINPipes[lIdx].ucDMAChannel = lIdx * 2;
                        }
                        else
                        {
                            //
                            // Go to the next USB pipe if the fixed one was not
                            // available.
                            //
                            continue;
                        }
                    }
                    else
                    {
                        //
                        // Either the fixed channel was not available or the
                        // pipe index was more than the first 3 pipes that are
                        // available on all parts.
                        //
                        for(lDMAIdx = 0; lDMAIdx < MAX_NUM_DMA_CHANNELS;
                            lDMAIdx += 2)
                        {
                            //
                            // Find any available channel.
                            //
                            if(g_sUSBHCD.ucDMAChannels[lDMAIdx] ==
                               USBHCD_DMA_UNUSED)
                            {
                                //
                                // Save the index and the DMA channel
                                // information.
                                //
                                g_sUSBHCD.ucDMAChannels[lDMAIdx] = lIdx;
                                g_sUSBHCD.USBINPipes[lIdx].ucDMAChannel =
                                    lDMAIdx;
                            }
                        }
                    }

                    //
                    // If no DMA channel was available then just disable DMA
                    // on this pipe.
                    //
                    if(g_sUSBHCD.USBINPipes[lIdx].ucDMAChannel ==
                       USBHCD_DMA_UNUSED)
                    {
                        ulEndpointType &= ~EP_PIPE_USE_UDMA;
                    }
                    else
                    {
                        //
                        // Set the DMA channel for this endpoint, this has no
                        // effect on parts without configurable DMA.
                        //
                        //
                        MAP_USBEndpointDMAChannel(
                            USB0_BASE, INDEX_TO_USB_EP(lIdx + 1),
                            g_sUSBHCD.USBINPipes[lIdx].ucDMAChannel);

                        //
                        // Clear all the attributes for the channel
                        //
                        MAP_uDMAChannelAttributeDisable(
                            g_sUSBHCD.USBINPipes[lIdx].ucDMAChannel,
                            UDMA_ATTR_ALL);

                        //
                        // Configure the uDMA channel for the pipe
                        //
                        MAP_uDMAChannelControlSet(
                            g_sUSBHCD.USBINPipes[lIdx].ucDMAChannel,
                            (UDMA_SIZE_8 | UDMA_SRC_INC_NONE | UDMA_DST_INC_8 |
                             UDMA_ARB_64));
                    }
                }

                //
                // Save the endpoint type and device address and callback
                // function.
                //
                g_sUSBHCD.USBINPipes[lIdx].ulType = ulEndpointType;
                g_sUSBHCD.USBINPipes[lIdx].ulDevAddr = ulDevAddr;
                g_sUSBHCD.USBINPipes[lIdx].pfnCallback = pfnCallback;

                //
                // Clear out any pending status on this endpoint in case it
                // was in use before a allowing a new device class to use it.
                //
                MAP_USBHostEndpointStatusClear(USB0_BASE,
                                               INDEX_TO_USB_EP(lIdx + 1),
                                               USB_HOST_IN_STATUS);

                //
                // Allocate space in the FIFO for this endpoint.
                //
                if(FIFOAlloc(&g_sUSBHCD.USBINPipes[lIdx], ulSize) != 0)
                {
                    //
                    // Configure the FIFO.
                    //
                    MAP_USBFIFOConfigSet(USB0_BASE, INDEX_TO_USB_EP(lIdx + 1),
                                         g_sUSBHCD.USBINPipes[lIdx].usFIFOAddr,
                                         g_sUSBHCD.USBINPipes[lIdx].ucFIFOSize,
                                         USB_EP_HOST_IN);
                }

                //
                // Set the function address for this endpoint.
                //
                MAP_USBHostAddrSet(USB0_BASE, INDEX_TO_USB_EP(lIdx + 1),
                                   ulDevAddr, USB_EP_HOST_IN);

                //
                // Reset the state of the pipe to idle.
                //
                g_sUSBHCD.USBINPipes[lIdx].eState = PIPE_IDLE;

                break;
            }
        }
    }

    //
    // Did not find a free pipe.
    //
    if(lIdx == MAX_NUM_PIPES)
    {
        return(0);
    }

    //
    // Return the pipe index and type that was allocated.
    //
    return(ulEndpointType | lIdx);
}

//*****************************************************************************
//
//! This function is used to allocate a USB HCD pipe.
//!
//! \param ulIndex specifies which USB controller to use.
//! \param ulEndpointType is the type of endpoint that this pipe will be
//! communicating with.
//! \param ulDevAddr is the device address to use for this endpoint.
//! \param pfnCallback is the function that will be called when events occur on
//! this USB Pipe.
//!
//! Since there are a limited number of USB HCD pipes that can be used in the
//! host controller, this function is used to temporarily or permanently
//! acquire one of the endpoints.  It also provides a method to register a
//! callback for status changes on this endpoint.  If no callbacks are desired
//! then the \e pfnCallback function should be set to 0.  The callback should
//! be used when using the USBHCDPipeSchedule() function so that the caller is
//! notified when the action is complete.
//!
//! \return This function returns a value indicating which pipe was reserved.
//! If the value is 0 then there were no pipes currently available.  This value
//! should be passed to any USBHCDPipe APIs to indicate which pipe is being
//! accessed.
//
//*****************************************************************************
unsigned long
USBHCDPipeAlloc(unsigned long ulIndex, unsigned long ulEndpointType,
                unsigned long ulDevAddr, tHCDPipeCallback pfnCallback)
{
    //
    // The old API allocated only 64 bytes to each endpoint.
    //
    return(USBHCDPipeAllocSize(ulIndex, ulEndpointType, ulDevAddr, 64,
                               pfnCallback));
}

//*****************************************************************************
//
//! This function is used to configure a USB HCD pipe.
//!
//! This should be called after allocating a USB pipe with a call to
//! USBHCDPipeAlloc().  It is used to set the configuration associated with an
//! endpoint like the max payload and target endpoint.  The \e ulMaxPayload
//! parameter is typically read directly from the devices endpoint descriptor
//! and is expressed in bytes.
//!
//! Setting the \e ulInterval parameter depends on the type of endpoint being
//! configured.  For endpoints that do not need to use the \e ulInterval
//! parameter \e ulInterval should be set to 0.  For Bulk \e ulInterval is a
//! value from 2-16 and will set the NAK timeout value as 2^(\e ulInterval-1)
//! frames.  For interrupt endpoints \e ulInterval is a value from 1-255 and
//! is the count in frames between polling the endpoint.  For isochronous
//! endpoints \e ulInterval ranges from 1-16 and is the polling interval in
//! frames represented as 2^(\e ulInterval-1) frames.
//!
//! \param ulPipe is the allocated endpoint to modify.
//! \param ulMaxPayload is maximum data that can be handled per transaction.
//! \param ulInterval is the polling interval for data transfers expressed in
//! frames.
//! \param ulTargetEndpoint is the target endpoint on the device to communicate
//! with.
//!
//! \return If the call was successful, this function returns zero any other
//! value indicates an error.
//
//*****************************************************************************
unsigned long
USBHCDPipeConfig(unsigned long ulPipe, unsigned long ulMaxPayload,
                 unsigned long ulInterval, unsigned long ulTargetEndpoint)
{
    unsigned long ulFlags;
    unsigned long ulIndex;

    //
    // Get the index number from the allocated pipe.
    //
    ulIndex = (ulPipe & EP_PIPE_IDX_M);

